assignment/homework/homework_2/answers/emp_ex_4_2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-04-01 Sat 11:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Empirical Exercises 4.2</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Zheng Tian" />
</head>
<body>
<div id="content">
<h1 class="title">Empirical Exercises 4.2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc24dae4">1. Reading the Data</a></li>
<li><a href="#orgc6a2b57">2. Summary Statistics</a></li>
</ul>
</div>
</div>
<p>
This file include answers and R codes for completing Empirical
Exercise 4.2 in Introduction to Econometrics (3rd edition) by Stock
and Watson.
</p>

<div id="outline-container-orgc24dae4" class="outline-2">
<h2 id="orgc24dae4"><span class="section-number-2">1</span> Reading the Data</h2>
<div class="outline-text-2" id="text-1">
<p>
The first step is to read the data file into R. The data files for
this problem are <code>TeachingRatings.dta</code> and <code>TeachingRatings.xls</code>,
accompanied by a descriptive file <code>TeachingRatings_Description.pdf</code>.
</p>

<ul class="org-ul">
<li><p>
Read the STATA file
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(foreign)
teachingdata <span style="color: #D0372D;">&lt;-</span> read.dta(<span style="color: #008000;">"TeachingRatings.dta"</span>)
</pre>
</div></li>

<li>Upon reading the data, we can take a glimpse on the data.

<ul class="org-ul">
<li><p>
Use <code>head</code> or <code>tail</code> to look at the first or last few observations
</p>

<div class="org-src-container">
<pre class="src src-R">head(teachingdata)
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-orgc6a2b57" class="outline-2">
<h2 id="orgc6a2b57"><span class="section-number-2">2</span> Summary Statistics</h2>
<div class="outline-text-2" id="text-2">
<p>
We get the summary statistics of the variables used in the analysis,
which is <code>course_eval</code> and <code>beauty</code>
</p>

<div class="org-src-container">
<pre class="src src-R">df <span style="color: #D0372D;">&lt;-</span> teachingdata[c(<span style="color: #008000;">"course_eval"</span>, <span style="color: #008000;">"beauty"</span>)]
sumdf <span style="color: #D0372D;">&lt;-</span> summary(df); sumdf
</pre>
</div>

<pre class="example">
 course_eval        beauty
Min.   :2.100   Min.   :-1.45049
1st Qu.:3.600   1st Qu.:-0.65627
Median :4.000   Median :-0.06801
Mean   :3.998   Mean   : 0.00000
3rd Qu.:4.400   3rd Qu.: 0.54560
Max.   :5.000   Max.   : 1.97002
</pre>

<p>
First, try to use <code>xtable</code> to generate the table in html
</p>
<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(xtable)
print(xtable(sumdf), type = <span style="color: #008000;">"html"</span>)
</pre>
</div>

<!-- html table generated in R 3.3.2 by xtable 1.8-2 package -->
<!-- Sat Apr  1 11:44:44 2017 -->
<table border=1>
<tr> <th>  </th> <th>  course_eval </th> <th>     beauty </th>  </tr>
  <tr> <td align="right"> 1 </td> <td> Min.   :2.100   </td> <td> Min.   :-1.45049   </td> </tr>
  <tr> <td align="right"> 2 </td> <td> 1st Qu.:3.600   </td> <td> 1st Qu.:-0.65627   </td> </tr>
  <tr> <td align="right"> 3 </td> <td> Median :4.000   </td> <td> Median :-0.06801   </td> </tr>
  <tr> <td align="right"> 4 </td> <td> Mean   :3.998   </td> <td> Mean   : 0.00000   </td> </tr>
  <tr> <td align="right"> 5 </td> <td> 3rd Qu.:4.400   </td> <td> 3rd Qu.: 0.54560   </td> </tr>
  <tr> <td align="right"> 6 </td> <td> Max.   :5.000   </td> <td> Max.   : 1.97002   </td> </tr>
   </table>



<p>
We can create a table that looks professional using the following
code.
</p>
<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(stargazer)
stargazer(df, type = <span style="color: #008000;">"html"</span>,
  title = <span style="color: #008000;">"Summary Statistics"</span>, label = <span style="color: #008000;">"tab:sum-stats"</span>)
</pre>
</div>


<table style="text-align:center"><caption><strong>Summary Statistics</strong></caption>
<tr><td colspan="6" style="border-bottom: 1px solid black"></td></tr><tr><td style="text-align:left">Statistic</td><td>N</td><td>Mean</td><td>St. Dev.</td><td>Min</td><td>Max</td></tr>
<tr><td colspan="6" style="border-bottom: 1px solid black"></td></tr><tr><td style="text-align:left">course_eval</td><td>463</td><td>3.998</td><td>0.555</td><td>2.100</td><td>5.000</td></tr>
<tr><td style="text-align:left">beauty</td><td>463</td><td>0.00000</td><td>0.789</td><td>-1.450</td><td>1.970</td></tr>
<tr><td colspan="6" style="border-bottom: 1px solid black"></td></tr></table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zheng Tian</p>
<p class="date">Created: 2017-04-01 Sat 11:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
