assignment/homework/homework_2/answers/emp_ex_4_2.tex
% Created 2017-04-01 Sat 11:44
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1.2in]{geometry}
\usepackage{setspace}
\singlespacing
\usepackage{parskip}
\setcounter{secnumdepth}{1}
\author{Zheng Tian}
\date{}
\title{Empirical Exercises 4.2}
\hypersetup{
 pdfauthor={Zheng Tian},
 pdftitle={Empirical Exercises 4.2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.3)},
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{1}
\tableofcontents

This file include answers and R codes for completing Empirical
Exercise 4.2 in Introduction to Econometrics (3rd edition) by Stock
and Watson.

\section{Reading the Data}
\label{sec:orgc901ce5}

The first step is to read the data file into R. The data files for
this problem are \texttt{TeachingRatings.dta} and \texttt{TeachingRatings.xls},
accompanied by a descriptive file \texttt{TeachingRatings\_Description.pdf}.

\begin{itemize}
\item Read the STATA file

\begin{verbatim}
library(foreign)
teachingdata <- read.dta("TeachingRatings.dta")
\end{verbatim}

\item Upon reading the data, we can take a glimpse on the data.

\begin{itemize}
\item Use \texttt{head} or \texttt{tail} to look at the first or last few observations

\begin{verbatim}
head(teachingdata)
\end{verbatim}
\end{itemize}
\end{itemize}


\section{Summary Statistics}
\label{sec:org085162a}

We get the summary statistics of the variables used in the analysis,
which is \texttt{course\_eval} and \texttt{beauty}

\begin{verbatim}
df <- teachingdata[c("course_eval", "beauty")]
sumdf <- summary(df); sumdf
\end{verbatim}

\begin{verbatim}
 course_eval        beauty
Min.   :2.100   Min.   :-1.45049
1st Qu.:3.600   1st Qu.:-0.65627
Median :4.000   Median :-0.06801
Mean   :3.998   Mean   : 0.00000
3rd Qu.:4.400   3rd Qu.: 0.54560
Max.   :5.000   Max.   : 1.97002
\end{verbatim}

First, try to use \texttt{xtable} to generate the table in html
\begin{verbatim}
library(xtable)
print(xtable(sumdf), type = "html")
\end{verbatim}

We can create a table that looks professional using the following
code.
\begin{verbatim}
library(stargazer)
stargazer(df, type = "html",
  title = "Summary Statistics", label = "tab:sum-stats")
\end{verbatim}
\end{document}